petrbrouzda/RatatoskrIoT/MCU/v50b-low_power-DS18B20__ESP32/src/ra/raConnection.cpp
#include <Arduino.h>

#include "../aes-sha/CRC32.h"

#define CBC 1
#define ECB 0
#define CTR 0
extern "C" {
    #include "../aes-sha/aes.h"
}

#include "../micro_ecc/uECC.h"

#include "../platform/platform.h"
#include "../platform/Esp8266RTCUserMemory.h"

#include "raConnection.h"

/* --- debug konfigurace - mozno povolit/zakazat -- */
/* detailni logovani bezne komunikace: */
// #define DETAILED_RA_LOG
/* detailni logovani prace s bloby: */
// #define BLOB_DETAIL_LOG


#ifdef ESP32
    RTC_DATA_ATTR long rtcIndicator;
    RTC_DATA_ATTR unsigned char rtcSessionId[32];
    RTC_DATA_ATTR unsigned char rtcSessionKey[32];    
#endif


static int RNG(uint8_t *dest, unsigned size) {

    while( size>=4 ) {
        *((int*)dest) = trng();
        size -= 4;
        dest += 4;
    }
    while( size!=0 ) {
        *dest = (unsigned char)( trng() & 0xff );
        size--;
        dest++;
    }

    return 1;
}


#define RAC_RTCMEM_MARKER 0xdeadface

raConnection::raConnection( raConfig * cfg, raLogger* logger  )
{
    this->logger = logger;
    this->cfg = cfg;
    this->connected = false;
    this->sha256=new Sha256();
    strcpy( this->appName, "-" );
    uECC_set_rng(&RNG);
    
    // pokud mame v RTC memory data o spojeni, nacteme je
    
    #ifdef ESP8266
        struct rtcData data;
        if( readRtcData( &data ) ) {
            this->logger->log( "RTC:OK" );
            memcpy( (void*)this->session, (const void *)(data.data), 32 );
            this->session[31] = 0;
            memcpy( (void*)this->sessionKey, (const void *)(data.data+32), 32 );
            this->connected = true;
        }
    #endif
    
    #ifdef ESP32
        if( rtcIndicator == RAC_RTCMEM_MARKER ) {
            this->logger->log( "RTC:OK" );
            memcpy( (void*)this->session, (const void *)(rtcSessionId), 32 );
            this->session[31] = 0;
            memcpy( (void*)this->sessionKey, (const void *)(rtcSessionKey), 32 );
            this->connected = true;
        }
    #endif
}


#ifdef DETAILED_RA_LOG
    #define LOG_BUFFER_LENGTH 100
    char log_buffer[LOG_BUFFER_LENGTH+LOG_BUFFER_LENGTH+1];
#endif



/**
 * payload: 
 *      CRC32 of data (4 byte)
 *      length of data (2 byte, low endian)
 *      data
 */
void raConnection::createDataPayload( BYTE *target, BYTE *source, int sourceLen )
{
    BYTE aes_iv[AES_BLOCKLEN];
    random_block( aes_iv, AES_BLOCKLEN );
    // tohle neni debug, ale uz si konstruuji zpravu!
    btohexa( aes_iv, AES_BLOCKLEN, (char *)target, 130 );
    
    BYTE payload[RACONN_MAX_DATA+1];
    payload[4] = (sourceLen>>8) & 0xff;
    payload[5] = sourceLen & 0xff;
    memcpy( payload+6, source, sourceLen );
    
    uint32_t crc1 = CRC32::calculate((unsigned char*) source, sourceLen);
    payload[0] = (BYTE)( (crc1>>24) & 0xff);
    payload[1] = (BYTE)( (crc1>>16) & 0xff);
    payload[2] = (BYTE)( (crc1>>8) & 0xff);
    payload[3] = (BYTE)(crc1 & 0xff);
    
    int celkovaDelka = sourceLen + 2 + 4;
    int zbyva = AES_BLOCKLEN - (celkovaDelka % AES_BLOCKLEN);
    if( zbyva>0 ) {  
        random_block( payload+celkovaDelka, zbyva );
    }
    
#ifdef DETAILED_RA_LOG
    this->logger->log( "  delka %d, doplneni %d", celkovaDelka, zbyva );

    btohexa( this->sessionKey, AES_KEYLEN, log_buffer, LOG_BUFFER_LENGTH );
    this->logger->log( "  session key: %s", log_buffer );
    
    this->logger->log( "  IV: %s", target );
#endif        

    celkovaDelka = celkovaDelka + zbyva;

    struct AES_ctx ctx;
    
    AES_init_ctx_iv(&ctx, (unsigned char const*)this->sessionKey, (unsigned char const*)aes_iv);
    AES_CBC_encrypt_buffer(&ctx, (unsigned char *)payload, celkovaDelka );

    char * output_ptr = (char *)target + AES_BLOCKLEN+AES_BLOCKLEN;
    output_ptr[0] = ':';
    output_ptr++;
    btohexa( payload, celkovaDelka, output_ptr, RACONN_MAX_DATA+RACONN_MAX_DATA );
    
#ifdef DETAILED_RA_LOG
    this->logger->log( "  out: %s", output_ptr );
#endif    
}


/**
 * 0 = OK
 * 1 = connection problem
 * 2 = invalid session, reconect later 
 */
int raConnection::sendInt( unsigned char * dataKOdeslani, int dataLen )
{
    if( !this->connected ) {
        this->login();
    }
    if( !this->connected ) {
        return 1;           
    }
        
    char url[256];
    sprintf( url, "http://%s/data", this->cfg->getString( "ra_url", "???" ) );
    
    this->logger->log( "%s DATA", this->identity );
    
    sprintf( (char *)this->msg, "%s\n", 
        this->session
         );

    BYTE* target = this->msg + strlen( (char *)this->msg ); 
    this->createDataPayload( target, (BYTE*)dataKOdeslani, dataLen );
    
    int rc = this->doRequest( url, this->msg, strlen((char*)this->msg) );
    
    if( rc==0 ) {  
        // 200
        this->logger->log( "%s OK", this->identity );
        return 0; 
    } else if( rc==1 ) {  
        // 403
        this->logger->log( "%s http403 -> relogin", this->identity );
        this->connected = false; 
        return 2; 
    } else {
        this->logger->log( "%s httpERR", this->identity );
        return 1;
    }
}


/**
 * 0 = OK
 * 1 = connection problem
 * 2 = invalid session, reconect later 
 */
int raConnection::send( unsigned char * dataKOdeslani, int dataLen )
{
    int rc = this->sendInt( dataKOdeslani, dataLen );
    if( rc==2 ) {
        // provedeme jeste jednou, tim dame sanci se prihlasit - to je nutne pri zmene konfigurace
        rc = this->sendInt( dataKOdeslani, dataLen );
    }

    return rc;
}


/*
long raConnection::readServerTime()
{
    char url[256];
    sprintf( url, "http://%s/time", this->cfg->getString( "ra_url", "???" ) );
    
    this->logger->log( "%s TIME", this->identity );
    
    HTTPClient http;
    http.begin( url );
    int httpCode = http.GET();
    String payload = http.getString();
    http.end();

    if( httpCode!=200 ) {
        // error description
        this->logger->log( "%s r%d [%s]", this->identity, httpCode, payload.c_str() );
        return 0;
    } else {
        long l = atol( (const char*)payload.c_str() );
        this->logger->log( "%s TIME=%d", this->identity, l );
        return l;
    }
}
*/





// definovano v aes.h
// #define AES_KEYLEN 32
// #define AES_BLOCKLEN 16
 




/**
 * Z hesla sestavi sestavi sifrovaci klic pro login blok.
 * Zasifruje s nim verejny klic
 * Vygeneruje cely payload blok pro login a zapise ho na vystupni adresu.
 */
void raConnection::createLoginToken( BYTE *target, BYTE * ecdh_public )
{
    BYTE aes_iv[AES_BLOCKLEN];
    
    this->sha256->init();
    const char * pass = this->cfg->getString( "$ra_pass", "???" );
    this->sha256->update((const BYTE *)pass, strlen((const char *)pass));
    this->sha256->final(this->sessionKey);
    
    random_block( aes_iv, AES_BLOCKLEN );
    // tohle neni debug, ale uz si konstruuji zpravu!
    btohexa( aes_iv, AES_BLOCKLEN, (char *)target, 130 );

#ifdef DETAILED_RA_LOG
    this->logger->log( "  password: '%s'", this->cfg->getString( "$ra_pass", "???" ) );
    btohexa( this->sessionKey, SHA256_BLOCK_SIZE, log_buffer, LOG_BUFFER_LENGTH );
    this->logger->log( "  password hash: %s", log_buffer );
    
    this->logger->log( "  IV: %s", target );
#endif        
    
