petrbrouzda/RatatoskrIoT/MCU/v50b-low_power-DS18B20__ESP32/src/ra/raConnection.cpp
#define LOGIN_PAYLOAD_LEN 64
    BYTE msg[LOGIN_PAYLOAD_LEN+1] ;
    memcpy( msg, ecdh_public, LOGIN_PAYLOAD_LEN );
    
    struct AES_ctx ctx;
    AES_init_ctx_iv(&ctx, (unsigned char const*)this->sessionKey, (unsigned char const*)aes_iv);
    AES_CBC_encrypt_buffer(&ctx, (unsigned char *)msg, LOGIN_PAYLOAD_LEN );

    // preskocime za IV
    char * output_ptr = (char *)target + AES_BLOCKLEN+AES_BLOCKLEN;
    output_ptr[0] = ':';
    output_ptr++;
    btohexa( msg, LOGIN_PAYLOAD_LEN, output_ptr, LOGIN_PAYLOAD_LEN+LOGIN_PAYLOAD_LEN+1 );  
    
}




char * parserPtr;

void textParser( char * text )
{
    parserPtr = text;
}

/**
 * Vrati do 'target' jednu radku ze vstupniho textu.
 * Pred spustenim je treba zavolat textParser( source );
 * Vraci true=neco nacteno, false=EOF
 */  
bool getNextLine( char * target, int targetSize )
{
    int targetPos = 0;
    target[0] = 0;

    while(1)
    {
        if( *parserPtr==0 ) {
            if( targetPos==0 ) {
                // jsme na konci a nic jsme nenacetli
                return false;
            } else {
                return true;
            }
        }

        if( *parserPtr==13 || *parserPtr==10 ) {
            if( targetPos==0 ) {
                // zatim jsme nic nenacetli, pokracujeme dal
                parserPtr++;
                continue;
            } else {
                return true;
            }
        }

        if( targetPos < (targetSize-1) ) {
            target[targetPos] = *parserPtr;
            target[targetPos+1] = 0;
            targetPos++;
        }
        parserPtr++;
    }
}

/**
 * Desifruje jeden prijaty balik v nasem formatu:
 *      <AES IV>:<AES_encrypted_data>
 * oboji zapsane jako retezec hexitu
 * 
 * Obsah plaintextu:
 *      CRC32 of data (4 byte)
 *      length of data (2 byte, low endian)
 *      payload
 * 
 * Parametry:
 *  encryptedData = vstupni data
 *  plainText = buffer pro desifrovana data (reusing bufferu z nadrizene fce)
 * 
 * Vraci:
 *  true = dekodovani OK
 *  false = neco selhalo
 */ 
bool raConnection::decryptBlock( char * encryptedData, char * plainText, int plainTextBuffSize )
{
    char * q = strchr( encryptedData, ':' );
    if( q==NULL ) {
        return false;
    }
    if( (q-encryptedData) != (AES_BLOCKLEN*2) ) {
        this->logger->log( "%s spatny format, ':' @ %d, total=%d", this->identity, (q-encryptedData), strlen(encryptedData) );
    }
    *q = 0;
    q++;

    BYTE aes_iv[AES_BLOCKLEN+1];
    hexatob( encryptedData, aes_iv, AES_BLOCKLEN );
    hexatob( q, (BYTE*)plainText, plainTextBuffSize );

    struct AES_ctx ctx;
    AES_init_ctx_iv(&ctx, this->sessionKey, aes_iv );
    AES_CBC_decrypt_buffer(&ctx, (unsigned char*)plainText, strlen(q)/2 );

    uint32_t crcReceived = (plainText[0] << 24) | (plainText[1] << 16) | (plainText[2] << 8) | plainText[3];
    int len = (plainText[4]<<8) | plainText[5];

    plainText[len+6] = 0;

    uint32_t crcComputed = CRC32::calculate((unsigned char*) plainText+6, len );

    if( crcReceived != crcComputed ) {
        this->logger->log( "%s cfg: CRC nesouhlasi moje:%x jejich:%x", this->identity, crcComputed, crcReceived );
        return false;
    }

    return true;
}


void raConnection::decryptPublicKeyBlock( char * encryptedData, char * plainText, int plainTextBuffSize )
{
    char * q = strchr( encryptedData, ':' );
    if( q==NULL ) {
        this->logger->log( "%s spatny format dat" );
        return;
    }
    if( (q-encryptedData) != (AES_BLOCKLEN*2) ) {
        this->logger->log( "%s spatny format, ':' @ %d, total=%d", this->identity, (q-encryptedData), strlen(encryptedData) );
    }
    *q = 0;
    q++;

    BYTE aes_iv[AES_BLOCKLEN+1];
    hexatob( encryptedData, aes_iv, AES_BLOCKLEN );
    hexatob( q, (BYTE*)plainText, plainTextBuffSize );

    struct AES_ctx ctx;
    AES_init_ctx_iv(&ctx, this->sessionKey, aes_iv );
    AES_CBC_decrypt_buffer(&ctx, (unsigned char*)plainText, strlen(q)/2 );
}


/**
 * encryptedData = vstupni data
 * plainText = buffer pro desifrovana data (reusing bufferu z nadrizene fce)
 * oneLine = buffer pro jednu radku z desifrovanych dat (reusing bufferu z nadrizene fce)
 */ 
void raConnection::parseConfigData( char * encryptedData, char * plainText, int plainTextBuffSize, char * oneLine, int oneLineSize )
{
    if( ! decryptBlock( encryptedData, plainText, plainTextBuffSize ) ) {
        return;
    }

    //D/ this->logger->log( "%s cfg pt [%s]", this->identity, plainText+6 );

    // v p mame dekodovany string
    // a v nem v p+6 je vlastni payload
    textParser( plainText+6 );
    if( getNextLine( oneLine, oneLineSize ) ) {
        //D/ this->logger->log( "%s config ver [%s]", this->identity, oneLine );
        int configVer = atol( oneLine );

        while( getNextLine( oneLine, oneLineSize ) ) {
            char *p = strchr( oneLine, '=' );
            if( p!=NULL ) {
                *p = 0;
                p++;
                //D/ 
                this->logger->log( "%s cfg [%s]=[%s]", this->identity, oneLine, p );
                this->cfg->setValue( oneLine, p );
            }
        }
        sprintf( oneLine, "%d", configVer );
        this->cfg->setValue( "@ver", oneLine );
        this->logger->log( "%s new config %d", this->identity, configVer );
    }
}


/**
 * Provede http POST request, zaloguje vse potrebne a vrati:
 * 0 = bylo http 200
 * 1 = chyba 403
 * 2 = jina chyba
 * Vystupni data jsou v this->httpBuffer
 */ 
int raConnection::doRequest( char * url, unsigned char * postData, int postDataLen )
{
    HTTPClient http;
    http.begin( url );
    http.addHeader("Content-Type", "application/octet-stream");
    int httpCode = http.POST( (
#ifdef ESP8266    
            const 
#endif            
            uint8_t*)postData, postDataLen );
    String result = http.getString();
    if( result.length() > RACONN_MSG_LEN ) {
        this->logger->log( "%s WARN: res length %d - more than buffer %d !", this->identity, result.length(), RACONN_MSG_LEN );
    }
    strncpy( this->httpBuffer, result.c_str() , RACONN_MSG_LEN );
    result = "";
    this->httpBuffer[RACONN_MSG_LEN] = 0;
    http.end();

#ifdef DETAILED_RA_LOG
    this->logger->log( "  %s << [%s]", this->identity, this->httpBuffer );
#endif    

    if( httpCode!=200 ) {
        // error description
        this->logger->log( "%s [%s]", this->identity, this->httpBuffer );
        return ( httpCode==403 ) ? 1 : 2;
    }
    return 0;
}



