petrbrouzda/RatatoskrIoT/MCU/v50b-low_power-DS18B20__ESP32/src/ra/raConnection.cpp
void raConnection::login() 
{
    /*
    * Potrebuji tri buffery pro rozbaleni prichozi sifrovane odpovedi.
    * - this->msg[RACONN_MSG_LEN 1024] byte pro vstupni sifrovany balik v hexa tvaru
    * - url[URL_BUFFER_LEN 512] pro desifrovany balik
    * - buff[BUFF_LEN 256] pro jednu radku odpovedi v sifrovanem bloku
    * 
    * Tj. cela zmena konfigurace muze mit maximalne 500 byte, a kazda radka (jmeno=hodnota) smi mit max 256 byte
    */ 

#define BUFF_LEN 256    
    char buff[BUFF_LEN];

#define URL_BUFFER_LEN 512
    // aby se usetrila pamet, "url" se pouziva i na parsovani prijate sifrovane odpovedi
    char url[URL_BUFFER_LEN+1];  
    sprintf( url, "http://%s/logina", this->cfg->getString( "ra_url", "???" ) );
    this->logger->log( "%s LOGINA", this->identity );


    char ecdh_private[33];
    char ecdh_public[65];
    char remote_ecdh_public[65];
    char ecdh_secret[33];
    const struct uECC_Curve_t * curve = uECC_secp256k1();


    // ---------------------------------------------------------------------------------
    // logina
    
    uECC_make_key( (uint8_t*)ecdh_public, (uint8_t*)ecdh_private, curve);

#ifdef DETAILED_RA_LOG    
    btohexa( (unsigned char*)ecdh_private, 32, buff, 256 );
    this->logger->log( "  ECDH private: %s", buff );
    btohexa( (unsigned char*)ecdh_public, 64, buff, 256 );
    this->logger->log( "  ECDH public: %s", buff );
#endif 

    sprintf( (char *)this->msg, "%s\n", 
        this->cfg->getString( "ra_dev_name", "???" ) );

    BYTE* target = this->msg + strlen( (char *)this->msg ); 
    this->createLoginToken( target, (BYTE*)ecdh_public );

#ifdef DETAILED_RA_LOG
    this->logger->log( "out: '%s'", this->msg );
#endif    
       
    int rc = this->doRequest( url, this->msg, strlen((char*)this->msg) );
    if( rc ) {
        this->connected = false; 
        return;
    }

    // ----------------------------------------------
    // prvni radek odpovedi = login msg id
    textParser( (char*)this->httpBuffer );
    if( ! getNextLine( (char*)this->session, 31 ) ) {
        // ve vystupnim textu neni ani jedna radka textu
        this->logger->log( "%s Neni zde nic 1.", this->identity );
        return;
    }

#ifdef DETAILED_RA_LOG
    this->logger->log( "  login msg id: %s", this->session );
#endif    

    if( ! getNextLine( (char*)this->msg, RACONN_MSG_LEN )  ) {
        this->logger->log( "%s Neni zde nic 2.", this->identity );
        return;
    }
    // v this->msg mame zasifrovany public klic protistrany
    decryptPublicKeyBlock( (char*)this->msg, remote_ecdh_public, 65 );

    int r = uECC_shared_secret( (uint8_t*)remote_ecdh_public, (uint8_t*)ecdh_private, (uint8_t*)ecdh_secret, curve );
    if( !r ) {
        this->logger->log( "chyba ECDH %d", r );
        return;
    }

    this->sha256->init();
    this->sha256->update((const BYTE *)ecdh_secret, 32 );
    this->sha256->final(this->sessionKey);

#ifdef DETAILED_RA_LOG    
    btohexa( (unsigned char*)remote_ecdh_public, 64, buff, 256 );
    this->logger->log( "  ECDH server public: %s", buff );
    btohexa( (unsigned char*)ecdh_secret, 32, buff, 256 );
    this->logger->log( "  ECDH secret: %s", buff );
    btohexa( this->sessionKey, 32, buff, 256 );
    this->logger->log( "  session key: %s", buff );    
#endif 

    // ---------------------------------------------------------------------------------
    // loginb

    sprintf( url, "http://%s/loginb", this->cfg->getString( "ra_url", "???" ) );
    this->logger->log( "%s LOGINB", this->identity );

    sprintf( (char *)this->msg, "%s\n", this->session );

    target = this->msg + strlen( (char *)this->msg ); 

    /*
    <poslední síla signálu WiFi>\n
    <uptime v sekundách>\n
    <config file version>\n
    <app name>
    */
    sprintf( buff, "%d\n%d\n%d\n%s",
        this->wifiSignalStrength,
        time(NULL),
        this->localConfigVersion,
        this->appName
    );

    this->createDataPayload( (BYTE*)target, (BYTE*)buff, strlen(buff) );

    rc = this->doRequest( url, this->msg, strlen((char*)this->msg) );
    if( rc ) {
        this->connected = false; 
        return;
    }

    textParser( (char*)this->httpBuffer );
    // prvni radka = session ID
    if( ! getNextLine( (char*)this->msg, RACONN_MSG_LEN ) ) {
        // ve vystupnim textu neni ani jedna radka textu
        this->logger->log( "%s Neni zde nic 3.", this->identity );
        return;
    }
    if( ! decryptBlock( (char*)this->msg, url, URL_BUFFER_LEN ) ) {
        return;
    }
    // v url je desifrovany blok, v url+6 je payload
    strncpy( this->session, url+6, 31 );
    this->session[31] = 0;

    // ----------------------------------------------
    // druhy radek odpovedi = zpracujeme zmeny konfigurace, pokud tam jsou
    if( getNextLine( (char*)this->msg, RACONN_MSG_LEN )  ) {
        // parseConfigData( char * encryptedData, char * plainText, int plainTextBuffSize, char * oneLine, int oneLineSize )
        this->parseConfigData( (char*)this->msg, url, URL_BUFFER_LEN, buff, BUFF_LEN );
    }

    this->logger->log( "%s OK %s", this->identity, this->session );

    // mame session v this->session a klic v this->sessionKey
    this->connected = true;
    
    // Ulozime si data o spojeni do RTC memory
    #ifdef ESP8266
        struct rtcData data;
        memcpy( (void*)(data.data), (const void *)this->session, 32 );
        memcpy( (void*)(data.data+32), (const void *)this->sessionKey, 32 );
        saveRtcData( &data );
    #endif
    
    #ifdef ESP32
        memcpy( (void*)(rtcSessionId), (const void *)this->session, 32 );
        memcpy( (void*)(rtcSessionKey), (const void *)this->sessionKey, 32 );
        rtcIndicator = RAC_RTCMEM_MARKER;
    #endif    
}



/**
 * Odesle jednu radku hlavicky na server
 */ 
void sendText( WiFiClient * client, char * data )
{
    #ifdef BLOB_DETAIL_LOG
        Serial.printf( "> %s\n", data  );
    #endif
    client->println( data );
}

int sentLen;

/**
 * Odesle jednu radku payloadu na server
 */ 
void sendBin( WiFiClient * client, uint8_t * data, size_t len )
{
    sentLen += len;
    #ifdef BLOB_DETAIL_LOG
        Serial.printf( "> %s\n", data );
        Serial.printf( "> %d .. %d\n", len , sentLen );
    #endif
    client->write( data, len );
}

#define MAX_LINE_LEN 256
char receivedLine[MAX_LINE_LEN+2];
int pos = 0;
bool lineComplete = false;

/**
 * Zpracovani odpovedi ze serveru - slozeni jednotlivych radek z prijatych znaku.
 */ 
void addChar( char c )
{
    if( c=='\n' ) {
        lineComplete = true;
    } else if( c=='\r' ) {
        receivedLine[pos] = 0;
    } else {
        if( pos < MAX_LINE_LEN ) {
            receivedLine[pos++] = c;
            receivedLine[pos] = 0;
        }
    }
}

/**
 * Vrati nactenou radku ze serveru
 */ 
char * getLine()
{
    pos = 0;
    lineComplete = false;
    //D/Serial.printf( "< [%s]\n", receivedLine  );
    return receivedLine;
}

#define BLOCKSIZE_PLAIN 512
#define BLOCKSIZE_CIPHER 1024

/**
 * Parsuje radku s http statusem
 */ 
int parseStatusLine( char * statusLine )
{
    char * p = strchr( statusLine, ' ' );
    if( p==NULL ) {
        return -1;
    } 
    int status = atoi( p );
    Serial.printf( "\nstatus=%d\n", status );
    if( status==200 ) {
        return 0;
    }
    return status;
}

/**
 * Zpracuje radku s aplikacni odpovedi z RA
 */ 
int parseDataLine( char * dataLine )
{
    if( strcmp(dataLine,"OK") == 0 ) {
        return 0;
    } else {
        Serial.printf( "ERR: %s\n", dataLine );
        return -1;
    }
}

/**
 * Zaloguje sifrovaci klic a IV
 */ 
void raConnection::log_keys( unsigned char * key, unsigned char * iv )
{
#ifdef BLOB_DETAIL_LOG
    char buff[256];
    btohexa( key, AES_KEYLEN, (char*)buff, 100 );
    int pos = AES_KEYLEN+AES_KEYLEN; 
    buff[pos] = ' ';
    btohexa( iv, AES_BLOCKLEN, (char*)buff+pos+1, 100 );
    pos += 1 + AES_BLOCKLEN + AES_BLOCKLEN;
    buff[pos] = 0;
    this->logger->log( "key/iv %s", buff );      
#endif
}

/**
 * Vlastni odeslani blobu; predpoklada, ze klient je prihlaseny.
 */ 
int raConnection::sendBlobInt( unsigned char * blob, int blobSize, int startTime, char * desc, char * extension )
{
    long start = millis();
    
    char server[200];
    char url[200];
    strcpy( server, this->cfg->getString( "ra_url", "???" ) );
    char * p = strchr( server, '/' );
    if( p==NULL ) { return 1; }
    strcpy(url, p);
    strcat( url, "/blob" );
    *p = 0;
    
    this->logger->log( "%s server=[%s] url=[%s]", this->identity, server, url );
    
    unsigned char begin[256];
    sprintf( (char*)begin, "%s\n", this->session );
    
    BYTE aes_iv[AES_BLOCKLEN];
    random_block( aes_iv, AES_BLOCKLEN );
    btohexa( aes_iv, AES_BLOCKLEN, (char *)(begin+strlen((const char*)begin)), 130 );
    strcat( (char*)begin, "\n");

    unsigned char header[512];
    sprintf( (char*)header, "%d\n%s\n%s\n%d\n",
        time(NULL)-startTime,
        desc,
        extension,
        blobSize
    );

    int len = strlen((const char*)header) ;
    if( (len % AES_BLOCKLEN) != 0 ) {
        len = ((len/AES_BLOCKLEN)+1)*AES_BLOCKLEN;
    } 
    struct AES_ctx ctx;
    AES_init_ctx_iv(&ctx, (unsigned char const*)this->sessionKey, (unsigned char const*)aes_iv);
    AES_CBC_encrypt_buffer(&ctx, (unsigned char *)header, len );

    unsigned char textBuff[BLOCKSIZE_CIPHER+10];

