petrbrouzda/RatatoskrIoT/MCU/v50b-low_power-DS18B20__ESP32/src/ra/raConnection.cpp
    btohexa( header, len, (char*)textBuff, BLOCKSIZE_PLAIN );
    int headerTextLen = strlen( (const char*)textBuff );
    textBuff[headerTextLen++] = '\n';
    textBuff[headerTextLen++] = 0;

    int beginSize = strlen( (const char*)begin );
    int blobBlocks = blobSize / BLOCKSIZE_PLAIN;
    if( (blobSize % BLOCKSIZE_PLAIN)!=0 ) { blobBlocks++; }
    int blobOutSize = (BLOCKSIZE_CIPHER+1)*blobBlocks;
    int totalLen = blobOutSize + beginSize + headerTextLen ;
    sentLen = 0;

    WiFiClient client;

    if (! client.connect(server, 80)) {
        Serial.println("Connect failed.");
        return 2;
    } else {
        Serial.println("Connected" );
    }

    char buf[256];
    sprintf( buf, "POST %s HTTP/1.1", url );
    sendText( &client, buf );

    sprintf( buf, "Host: %s", server );
    sendText( &client, buf );
    sprintf( buf, "Content-Length: %d", totalLen );
    sendText( &client, buf );
    sendText( &client, (char *)"Content-Type: application/octet-stream" );
    sendText( &client, (char *)"" );

    totalLen = 0;
    sendBin( &client, begin, beginSize );
    sendBin( &client, textBuff, headerTextLen );

    unsigned char binData[BLOCKSIZE_PLAIN+2];

    Serial.printf( "len %d kB\n", blobSize/1024 );

    uint8_t *fbBuf = blob;
    for (size_t n=0; n<blobSize; n=n+BLOCKSIZE_PLAIN) {
        if( n % 10240 == 0 ) {
            Serial.printf( "%d kB  ", n/1024 );
        }
        #ifdef BLOB_DETAIL_LOG
            Serial.printf( "n=%d, size=%d\n",n, blobSize );
            log_keys( (unsigned char*)this->sessionKey, (unsigned char*)aes_iv );
        #endif
        if (n+BLOCKSIZE_PLAIN < blobSize) {
            #ifdef BLOB_DETAIL_LOG
                Serial.println( "v1" );
            #endif
            memcpy( binData, fbBuf, BLOCKSIZE_PLAIN );
            AES_init_ctx_iv(&ctx, (unsigned char const*)this->sessionKey, (unsigned char const*)aes_iv);
            AES_CBC_encrypt_buffer(&ctx, binData, BLOCKSIZE_PLAIN );
            btohexa( binData, BLOCKSIZE_PLAIN, (char*)textBuff, 1025 );
            textBuff[1024] = '\n';
            textBuff[1025] = 0;
            sendBin( &client,textBuff, 1025 );
            fbBuf += BLOCKSIZE_PLAIN;
        }
        else if (blobSize % BLOCKSIZE_PLAIN > 0) {
            size_t remainder = blobSize % BLOCKSIZE_PLAIN;
            #ifdef BLOB_DETAIL_LOG
                Serial.printf( "v2 remainder=%d\n", remainder );
            #endif
            memcpy( binData, fbBuf, remainder );
            AES_init_ctx_iv(&ctx, (unsigned char const*)this->sessionKey, (unsigned char const*)aes_iv);
            AES_CBC_encrypt_buffer(&ctx, binData, BLOCKSIZE_PLAIN );
            btohexa( binData, BLOCKSIZE_PLAIN, (char*)textBuff, 1025 );
            textBuff[1024] = '\n';
            textBuff[1025] = 0;
            sendBin( &client,textBuff, 1025 );
        }
    }   

    int timeoutTimer = RA_BLOB_TIMEOUT;
    long startTimer = millis();

    /**
     * Stavovy automat pro zpracovani vysledku. Vnitrni stavy:
     * 0 = cekam na http status line
     * 1 = cekam na konec hlavicky
     * 2 = cekam na prvni radek dat
     * 3 = hotovo
     */
    int status = 0;
    int rc = 3;

    Serial.println("");

    while( (status!=3) && (startTimer + timeoutTimer) > millis() ) {
        Serial.print(".");
        delay(100);      
        while (client.available()) {
            addChar( client.read() );
            startTimer = millis();
            if( lineComplete ) {
                char * line = getLine();
                if( status==0 ) {
                    rc=parseStatusLine( line );
                    if( rc!=0 ) {
                        status = 3;
                        break;
                    }
                    status = 1;
                } else if( status==1 ) {
                    if( strlen(line)==0 ) {
                        // prazdna radka = konec hlavicky
                        status = 2;
                    }
                } else if( status==2 ) {
                    if( 0==parseDataLine( line ) ) {
                        rc = 0;
                    } else {
                        rc = 4;
                    }
                    status = 3;
                    break;
                }
            }
        } // while (client.available()) {
    }
    client.stop();
    
    Serial.printf( "BLOB %d s\n", ((millis()-start)/1000) );
    
    return rc;
}

/**
 * Odesle blob. Pokud neni prihlaseno, prihlasi.
 * 0 = OK, jina hodnota = chyba; >=300 http result code.
 */ 
int raConnection::sendBlob( unsigned char * blob, int blobSize, int startTime, char * desc, char * extension )
{
    this->logger->log( "%s BLOB+", this->identity );

    if( !this->connected ) {
        this->login();
    }
    if( !this->connected ) {
        this->logger->log( "%s BLOB-ERR no login, no sendin'", this->identity );
        return 1;           
    }
    
    int rc = this->sendBlobInt( blob, blobSize, startTime, desc, extension );
    if( rc!=0 ) {
        this->logger->log( "%s BLOB ERR %d, reconnect", this->identity, rc );
        this->login();
        if( this->connected ) {
            rc = this->sendBlobInt( blob, blobSize, startTime, desc, extension );               
        }
    }

    if( rc==0 ) {    
        this->logger->log( "%s BLOB-OK", this->identity );
    } else {
        this->logger->log( "%s BLOB-ERR %d", this->identity, rc );
    } 
    return rc;
}
    

/**
 * Pokud neni spojene, prihlasi se
 * Vraci true = prihlaseno; false = neprihlaseno
 */ 
bool raConnection::isConnected()
{
    if( !this->connected ) {
        this->login();
    }
    if( !this->connected ) {
        return false;           
    }
    return true;
}

void raConnection::setAppName( const char * appName )
{
    strncpy( this->appName, appName, RA_APP_NAME_SIZE );
    this->appName[RA_APP_NAME_SIZE] = 0;
}

void raConnection::setConfigVersion( int version )
{
    this->localConfigVersion = version;
}

void raConnection:: setRssi( int rssi )
{
    this->wifiSignalStrength = rssi;
}
